Tekla.Structures.Drawing.UI.Picker
The Picker class is used to pick points and objects in the drawing.
using Tekla.Structures.Drawing;
using Tekla.Structures.Drawing.UI;
using Tekla.Structures.Geometry3d;
public class Example
{
public void PickPointExample()
{
var drawingHandler = new DrawingHandler();
Picker picker = drawingHandler.GetPicker();
try
{
var pick = picker.PickPoint("Pick_point");
var point = pick.Item1;
var view = pick.Item2;
// Do something with the picked point and view.
}
catch(PickerInterruptedException)
{
// No pick happened
}
}
}
Remarks:
Prompts
Tekla Structures prefixes the given prompt with "prompt_" and
looks for a translation in the prompts.ail file. If the translation
(e.g. "prompt_Pick_first_position") is not found in the prompts.ail
file, the prompt string is displayed as such. This feature can be used to
give already translated strings to the picker.
using Tekla.Structures.Drawing;
using Tekla.Structures.Drawing.UI;
using Tekla.Structures.Geometry3d;
public class Example
{
public void Example1()
{
DrawingHandler drawingHandler = new DrawingHandler();
Picker picker = drawingHandler.GetPicker();
Point point = null;
ViewBase view = null;
string prompt = "Picke zwei Punkte um die Richtung vorzugeben";
picker.PickPoint(prompt, out point, out view);
}
}

Tekla.Structures.Drawing.UI.Picker.#ctor(Tekla.Structures.Drawing.Drawing)
Initializes drawing editor picker.
drawing: Target drawing editor.

Tekla.Structures.Drawing.UI.Picker.IsInteractive
Indicates whether the picker is interactive and currently allowed to access the UI or not.
If not, then the plug-in should avoid making dialog calls or message boxes.
Returns: True if the picker is interactive.

Tekla.Structures.Drawing.UI.Picker.PickPoint(System.String,Tekla.Structures.Geometry3d.Point@,Tekla.Structures.Drawing.ViewBase@)
Requests the user to pick one point.
prompt: The prompt shown in the status bar.
See the class remarks for more information about prompts.
pickedPoint: The picked point in the view coordinates.
pickedView: The view in which the pick occurred.
Throws Tekla.Structures.Drawing.InvalidPluginPickerInputException:
Thrown when the picker is being used through a plug-in which has invalid PluginPickerInputs defined.
Throws Tekla.Structures.Drawing.PickerInterruptedException:
Thrown when the user interrupts the picker before anything has been picked.

Tekla.Structures.Drawing.UI.Picker.PickPoint(System.String)
Requests the user to pick one point.
Returns the picked point in the view coordinates and the view in which the pick occurred.
prompt: The prompt shown in the status bar.
See the class remarks for more information about prompts.
Throws Tekla.Structures.Drawing.InvalidPluginPickerInputException:
Thrown when the picker is being used through a plug-in which has invalid PluginPickerInputs defined.
Throws Tekla.Structures.Drawing.PickerInterruptedException:
Thrown when the user interrupts the picker before anything has been picked.

Tekla.Structures.Drawing.UI.Picker.PickTwoPoints(System.String,System.String,Tekla.Structures.Geometry3d.Point@,Tekla.Structures.Geometry3d.Point@,Tekla.Structures.Drawing.ViewBase@)
Requests a pick of two points from the user.
firstPrompt: The prompt shown in the status bar before the first pick.
See the class remarks for more information about prompts.
secondPrompt: The prompt shown in the status bar before the second pick.
See the class remarks for more information about prompts.
firstPickedPoint: The first picked point in the view coordinates.
secondPickedPoint: The second picked point in the view coordinates.
pickedView: The view in which the pick occurred.
Throws Tekla.Structures.Drawing.InvalidPluginPickerInputException:
Thrown when the picker is being used through a plug-in which has invalid PluginPickerInputs defined.
Throws Tekla.Structures.Drawing.PickerInterruptedException:
Thrown when the user interrupts the picker before anything has been picked.

Tekla.Structures.Drawing.UI.Picker.PickThreePoints(System.String,System.String,System.String,Tekla.Structures.Geometry3d.Point@,Tekla.Structures.Geometry3d.Point@,Tekla.Structures.Geometry3d.Point@,Tekla.Structures.Drawing.ViewBase@)
Requests a pick of three points from the user.
firstPrompt: The prompt shown in the status bar before the first pick.
See the class remarks for more information about prompts.
secondPrompt: The prompt shown in the status bar before the second pick.
See the class remarks for more information about prompts.
thirdPrompt: The prompt shown in the status bar before the third pick.
See the class remarks for more information about prompts.
firstPickedPoint: The first picked point in the view coordinates.
secondPickedPoint: The second picked point in the view coordinates.
thirdPickedPoint: The third picked point in the view coordinates.
pickedView: The view in which the pick occurred.
Throws Tekla.Structures.Drawing.InvalidPluginPickerInputException:
Thrown when the picker is being used through a plug-in which has invalid PluginPickerInputs defined.
Throws Tekla.Structures.Drawing.PickerInterruptedException:
Thrown when the user interrupts the picker before anything has been picked.

Tekla.Structures.Drawing.UI.Picker.PickPoints(System.Int32,Tekla.Structures.Drawing.StringList,Tekla.Structures.Drawing.PointList@,Tekla.Structures.Drawing.ViewBase@)
Requests N picks of points from the user.
numberOfPicks: The number of requested picks.
prompts: The prompts shown in the status bar before the picks.
See the class remarks for more information about prompts.
pickedPoints: The picked points in the view coordinates.
pickedView: The view in which the pick occurred.
Throws Tekla.Structures.Drawing.InvalidPluginPickerInputException:
Thrown when the picker is being used through a plug-in which has invalid PluginPickerInputs defined.
Throws Tekla.Structures.Drawing.PickerInterruptedException:
Thrown when the user interrupts the picker before anything has been picked.

Tekla.Structures.Drawing.UI.Picker.PickPoints(System.Int32,Tekla.Structures.Drawing.StringList)
Requests N picks of points from the user.
Returns the picked points in the view coordinates and the view in which the pick occurred.
numberOfPicks: The number of requested picks.
prompts: The prompts shown in the status bar before the picks.
See the class remarks for more information about prompts.
Throws Tekla.Structures.Drawing.InvalidPluginPickerInputException:
Thrown when the picker is being used through a plug-in which has invalid PluginPickerInputs defined.
Throws Tekla.Structures.Drawing.PickerInterruptedException:
Thrown when the user interrupts the picker before anything has been picked.

Tekla.Structures.Drawing.UI.Picker.PickPoints(Tekla.Structures.Drawing.StringList,Tekla.Structures.Drawing.PointList@,Tekla.Structures.Drawing.ViewBase@)
Requests picks of points from the user. The sequence is terminated by the middle button pick.
prompts: The prompts shown in the status bar before the picks.
See the class remarks for more information about prompts.
pickedPoints: The picked points in the view coordinates.
pickedView: The view in which the pick occurred.
Throws Tekla.Structures.Drawing.InvalidPluginPickerInputException:
Thrown when the picker is being used through a plug-in which has invalid PluginPickerInputs defined.
Throws Tekla.Structures.Drawing.PickerInterruptedException:
Thrown when the user interrupts the picker before anything has been picked.

Tekla.Structures.Drawing.UI.Picker.PickPoints(Tekla.Structures.Drawing.StringList)
Requests picks of points from the user. The sequence is terminated by the middle button pick.
Returns the picked points in the view coordinates and the view in which the pick occurred.
prompts: The prompts shown in the status bar before the picks.
See the class remarks for more information about prompts.
Throws Tekla.Structures.Drawing.InvalidPluginPickerInputException:
Thrown when the picker is being used through a plug-in which has invalid PluginPickerInputs defined.
Throws Tekla.Structures.Drawing.PickerInterruptedException:
Thrown when the user interrupts the picker before anything has been picked.

Tekla.Structures.Drawing.UI.Picker.PickObject(System.String,Tekla.Structures.Drawing.DrawingObject@,Tekla.Structures.Drawing.ViewBase@)
Requests the user to pick one object.
prompt: The prompt shown in the status bar before the pick.
See the class remarks for more information about prompts.
pickedObject: The picked drawing object.
pickedView: The view in which the pick occurred.
Throws Tekla.Structures.Drawing.InvalidPluginPickerInputException:
Thrown when the picker is being used through a plug-in which has invalid PluginPickerInputs defined.
Throws Tekla.Structures.Drawing.PickerInterruptedException:
Thrown when the user interrupts the picker before anything has been picked.

Tekla.Structures.Drawing.UI.Picker.PickObject(System.String)
Requests the user to pick one object.
Returns the picked drawing object and the view in which the pick occurred.
prompt: The prompt shown in the status bar before the pick.
See the class remarks for more information about prompts.
Throws Tekla.Structures.Drawing.InvalidPluginPickerInputException:
Thrown when the picker is being used through a plug-in which has invalid PluginPickerInputs defined.
Throws Tekla.Structures.Drawing.PickerInterruptedException:
Thrown when the user interrupts the picker before anything has been picked.

Tekla.Structures.Drawing.UI.Picker.PickObject(System.String,Tekla.Structures.Drawing.DrawingObject@,Tekla.Structures.Drawing.ViewBase@,Tekla.Structures.Geometry3d.Point@)
Requests the user to pick one object. Returns the picked point in addition to the picked object.
prompt: The prompt shown in the status bar before the picks.
See the class remarks for more information about prompts.
pickedObject: The picked drawing object.
pickedView: The view in which the pick occurred.
pickedPoint: The picked point in the view coordinates.
Throws Tekla.Structures.Drawing.InvalidPluginPickerInputException:
Thrown when the picker is being used through a plug-in which has invalid PluginPickerInputs defined.
Throws Tekla.Structures.Drawing.PickerInterruptedException:
Thrown when the user interrupts the picker before anything has been picked.

Tekla.Structures.Drawing.UI.Picker.PickObjectAndPoint(System.String)
Requests the user to pick one object.
Returns the picked drawing object, the view in which the pick occurred and picked point in the view coordinates.
prompt: The prompt shown in the status bar before the pick.
See the class remarks for more information about prompts.
Throws Tekla.Structures.Drawing.InvalidPluginPickerInputException:
Thrown when the picker is being used through a plug-in which has invalid PluginPickerInputs defined.
Throws Tekla.Structures.Drawing.PickerInterruptedException:
Thrown when the user interrupts the picker before anything has been picked.

Tekla.Structures.Drawing.UI.Picker.PickObject(System.String,System.Type[],Tekla.Structures.Drawing.DrawingObject@,Tekla.Structures.Drawing.ViewBase@,Tekla.Structures.Geometry3d.Point@)
Requests the user to pick one object of the given types. Returns the picked point in addition to the picked object.
prompt: The prompt shown in the status bar before the picks.
See the class remarks for more information about prompts.
typeFilter: The types to pick. If null, any type is allowed.
pickedObject: The picked drawing object.
pickedView: The view in which the pick occurred.
pickedPoint: The picked point in the view coordinates.
Throws Tekla.Structures.Drawing.InvalidPluginPickerInputException:
Thrown when the picker is being used through a plug-in which has invalid PluginPickerInputs defined.
Throws Tekla.Structures.Drawing.PickerInterruptedException:
Thrown when the user interrupts the picker before anything has been picked.
Remarks:
The list of types to pick may contain any object derived from DrawingObject or
DrawingObject itself. For example, typeof(ModelObject) will allow picking of
part, bolts, reinforcements, etc.
using Tekla.Structures.Drawing;
using System;
public class Example
{
public void Example1()
{
// Allow picking of model objects and rectangles.
Type [] TypeFilter = new Type[] { typeof(ModelObject), typeof(Rectangle) };
}
}
using Tekla.Structures.Drawing;
using System;
public class Example
{
public void Example1()
{
// Allow picking of all kinds of dimensions.
Type [] TypeFilter = new Type[] { typeof(DimensionBase) };
}
}

Tekla.Structures.Drawing.UI.Picker.PickPoints(Tekla.Structures.Drawing.StringList,System.Int32,Tekla.Structures.Drawing.UI.Picker.PickerTypes)
The function the performs all the point picking

Tekla.Structures.Drawing.UI.Picker.PickObjects(System.String,Tekla.Structures.Drawing.UI.Picker.PickerTypes,System.Type[])
The function that performs the actual object picking, used by the other PickObject(s) - functions